resource/request_file/CholaMS_Car_Premium.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:PremiumComputationNewAndMarketRenewal>
         <!--Optional:-->
         <tem:strInput>
         {
  "AdditionalBenefits": {
    "AutoExtensionofPolicy": "false",
    "BreakinReferenceNo": "0",
    "CareExecutive": "___addon_road_assist_cover___",
    "CareStandard": "___addon_road_assist_cover___",
    "CholaValueAddedServicesCover": "false",
    "CholamandalamMSAssistanceforRoadsideEmergencies": "___addon_road_assist_cover___",
    "Claimsinexpiringpolicy": "___is_claim_exists___",
    "ConsumableCoverage": "___addon_consumable_cover___",
    "ConsumablePlusCover": "false",
    "ConveyanceAllowanceCover": "___addon_inconvenience_allowance_cover___",
    "CoverageOfInsuranceCost": "false",
    "CoverageforRoadTaxandregistrationcharges": "false",
    "CoverforDrivingLicenseloss": "false",
    "CoverforPersonalluggageloss": "false",
    "CoverforVehicleIgnitionkey": "false",
    "DailyCashAllowance": "___addon_daily_allowance_cover___",
    "DisabledVehicleCoverage": "false",
    "EMIProtectionCover": "false",
    "EMIValue": "0",
    "EngineSeizurePlusCover": "___addon_engine_protector_cover___",
    "ExpiringPolicyEndDate": "___policy_expiry_date___",
    "ExpiringPolicyStartDate": "___pre_policy_start_date___",
    "FiberTank": "false",
    "FullDeprWaiverCover": "false",
    "HydrostaticLockCover": "___addon_hydrostatic_lock_cover___",
    "KeyReplacementCover": "___addon_key_lock_cover___",
    "LoanProtection": "false",
    "MedicalExpensesCoverage": "___addon_medical_expense_cover___",
    "MonthlyInstallmentCover": "false",
    "NCBPercentage": "___vehicle_ncb_next___",
    "NewVehicleReplacement": "false",
    "NoClaimBonusProtection": "___addon_ncb_protection_cover___",
    "NoOfDays": "1",
    "NoofInstallments": "1",
    "NoofTrailers": "0",
    "NumberOfTyres": "0",
    "OptionConveyaAllowanceCover": "0",
    "OptionForMonthlyInstallmentCover": "A",
    "OptionsTimeExcessFranchise": "0",
    "OptionsforDailyCashAllowance": "A",
    "PenaltyCoverage": "false",
    "PercentageWaiverofReductioninDepreciation": "0%",
    "PermitLoss": "false",
    "PolicyNumber": "74474747474",
    "PolicyType": "___vehicle_insurance_subtype___",
    "PreExistingDamage": "No",
    "PrevInsurCompanyNameCode": "___dbmaster_previousinsurer_code___",
    "RegistrationCertificateLossCover": "false",
    "RegistrationCost": "5000",
    "ReimbursementofCostofDuplicateKeys": "false",
    "ReinstatementValuebasis": "false",
    "ReturnToInvoice": "___addon_invoice_price_cover___",
    "RimSafeguardCover": "false",
    "RoadTaxPaid": "0",
    "TimeExcess": "0",
    "TimeExcessForDC": "0",
    "TimeExcessForMIC": "5",
    "TrailerChassisNumber": "0",
    "TrailerRegisNumber": "0",
    "TyreSafeguardCover": "false",
    "WaiverofReductioninDepreciation": "false",
    "WrongFueling": "false"
  },
  "CoverVehicleAccessories": {
    "AgeofNominee": "0",
    "FibreGlassFuelTank": "false",
    "FranchiseAgreementDiscount": "false",
    "IDVofElectricalAccessories": "___electrical_accessory___",
    "IDVofNonElectricalAccessories": "___non_electrical_accessory___",
    "IMT46": "false",
    "Indemnitytohirer": "false",
    "IsPAforPaidDriver": "___is_pa_paid_driver___",
    "LLtoEmployees": "false",
    "LLtoPaidDriver": "___is_llpd___",
    "LPGCNGIDV": "___external_bifuel_value___",
    "NameofPersons": "",
    "NumberofEmployees": "0",
    "NumberofPaidDrivers": "1",
    "NumberofPerson": "0",
    "NumberofUnNamedPerson": "___dbmaster_insurer_vehicle_seatingcapacity___",
    "PACoverforUnNamedPerson": "___is_pa_unnamed_passenger___",
    "PersonalAcciCoverForOwnerDriver": "___pa_owner_driver_si___",
    "PersonalCoverforNamedDriver": "false",
    "SumInsuredforNamedPersons": "0",
    "SumInsuredforPAforPaidDriver": "___pa_paid_driver_si___",
    "SumInsuredforUnNamedPersons": "___pa_unnamed_passenger_si___",
    "TypeOfElectricalAccessories": ""
  },
  "CustomerData": {
    "AadharNumber": "",
    "Area": "23093",
    "DateOfBirth": "01/01/1900",
    "EmailID": "",
    "FinancierCode": "0",
    "Gender": "",
    "InsuredAddress": "",
    "InsuredName": "Chxhc",
    "MobileNumber": "7485935353",
    "PinCode": "600018",
    "TypeOfCustomer": "I"
  },
  "Discounts": {
    "Bangladesh": "0",
    "Bhutan": "0",
    "DTD": "0",
    "ExtensionCountryName": "No",
    "IMT23": "false",
    "Maldives": "0",
    "Nepal": "0",
    "Pakistan": "0",
    "Srilanka": "0",
    "VoluntaryExcess": "0"
  },
  "IntermediaryCode": "200264572663",
  "TieUp": "PolicyBoss",
  "TransactionType": "___vehicle_insurance_type_2___",
  "UniqueTransactionID": "1552050575828",
  "VehicleDetails": {
    "BodyPrice": "0",
    "ChassisNumber": "Chassis123",
    "ChassisPrice": "0",
    "DateOfRegistration": "___vehicle_registration_date___",
    "EngineNumber": "Engine123",
    "FuelType": "PETROL",
    "IDV": "___vehicle_expected_idv___",
    "IsHandicapped": "false",
    "NoDrivingLicense": "",
    "NoofyearsforPAownerdriver": "___vehicle_insurance_subtype_3___",
    "PolicyEndDate": "___policy_end_date___",
    "PolicyStartDate": "___policy_start_date___",
    "RTOLocationCode": "12998",
    "RegistrationNumber": "BB-22-MM-7777",
    "TPPDLimit": "0",
    "TenureOption": "___vehicle_insurance_subtype_2___",
    "VehicleModelCode": "___dbmaster_insurer_vehicle_model_code___",
    "YearofManufacturer": "___vehicle_manf_year___"
  },
  "VehicleType": "___product_id_2___"
}
         </tem:strInput>
      </tem:PremiumComputationNewAndMarketRenewal>
   </soapenv:Body>
</soapenv:Envelope>